GopalSaraf/Practicals/PSDL/include/proc/pic18f67k90.inc
// Register: ANCON2
#define ANCON2 ANCON2
ANCON2                                   equ 0F23h
// bitfield definitions
ANCON2_ANSEL16_POSN                      equ 0000h
ANCON2_ANSEL16_POSITION                  equ 0000h
ANCON2_ANSEL16_SIZE                      equ 0001h
ANCON2_ANSEL16_LENGTH                    equ 0001h
ANCON2_ANSEL16_MASK                      equ 0001h
ANCON2_ANSEL17_POSN                      equ 0001h
ANCON2_ANSEL17_POSITION                  equ 0001h
ANCON2_ANSEL17_SIZE                      equ 0001h
ANCON2_ANSEL17_LENGTH                    equ 0001h
ANCON2_ANSEL17_MASK                      equ 0002h
ANCON2_ANSEL18_POSN                      equ 0002h
ANCON2_ANSEL18_POSITION                  equ 0002h
ANCON2_ANSEL18_SIZE                      equ 0001h
ANCON2_ANSEL18_LENGTH                    equ 0001h
ANCON2_ANSEL18_MASK                      equ 0004h
ANCON2_ANSEL19_POSN                      equ 0003h
ANCON2_ANSEL19_POSITION                  equ 0003h
ANCON2_ANSEL19_SIZE                      equ 0001h
ANCON2_ANSEL19_LENGTH                    equ 0001h
ANCON2_ANSEL19_MASK                      equ 0008h
ANCON2_PCFG16_POSN                       equ 0000h
ANCON2_PCFG16_POSITION                   equ 0000h
ANCON2_PCFG16_SIZE                       equ 0001h
ANCON2_PCFG16_LENGTH                     equ 0001h
ANCON2_PCFG16_MASK                       equ 0001h
ANCON2_PCFG17_POSN                       equ 0001h
ANCON2_PCFG17_POSITION                   equ 0001h
ANCON2_PCFG17_SIZE                       equ 0001h
ANCON2_PCFG17_LENGTH                     equ 0001h
ANCON2_PCFG17_MASK                       equ 0002h
ANCON2_PCFG18_POSN                       equ 0002h
ANCON2_PCFG18_POSITION                   equ 0002h
ANCON2_PCFG18_SIZE                       equ 0001h
ANCON2_PCFG18_LENGTH                     equ 0001h
ANCON2_PCFG18_MASK                       equ 0004h
ANCON2_PCFG19_POSN                       equ 0003h
ANCON2_PCFG19_POSITION                   equ 0003h
ANCON2_PCFG19_SIZE                       equ 0001h
ANCON2_PCFG19_LENGTH                     equ 0001h
ANCON2_PCFG19_MASK                       equ 0008h

// Register: ANCON1
#define ANCON1 ANCON1
ANCON1                                   equ 0F24h
// bitfield definitions
ANCON1_ANSEL8_POSN                       equ 0000h
ANCON1_ANSEL8_POSITION                   equ 0000h
ANCON1_ANSEL8_SIZE                       equ 0001h
ANCON1_ANSEL8_LENGTH                     equ 0001h
ANCON1_ANSEL8_MASK                       equ 0001h
ANCON1_ANSEL9_POSN                       equ 0001h
ANCON1_ANSEL9_POSITION                   equ 0001h
ANCON1_ANSEL9_SIZE                       equ 0001h
ANCON1_ANSEL9_LENGTH                     equ 0001h
ANCON1_ANSEL9_MASK                       equ 0002h
ANCON1_ANSEL10_POSN                      equ 0002h
ANCON1_ANSEL10_POSITION                  equ 0002h
ANCON1_ANSEL10_SIZE                      equ 0001h
ANCON1_ANSEL10_LENGTH                    equ 0001h
ANCON1_ANSEL10_MASK                      equ 0004h
ANCON1_ANSEL11_POSN                      equ 0003h
ANCON1_ANSEL11_POSITION                  equ 0003h
ANCON1_ANSEL11_SIZE                      equ 0001h
ANCON1_ANSEL11_LENGTH                    equ 0001h
ANCON1_ANSEL11_MASK                      equ 0008h
ANCON1_PCFG8_POSN                        equ 0000h
ANCON1_PCFG8_POSITION                    equ 0000h
ANCON1_PCFG8_SIZE                        equ 0001h
ANCON1_PCFG8_LENGTH                      equ 0001h
ANCON1_PCFG8_MASK                        equ 0001h
ANCON1_PCFG9_POSN                        equ 0001h
ANCON1_PCFG9_POSITION                    equ 0001h
ANCON1_PCFG9_SIZE                        equ 0001h
ANCON1_PCFG9_LENGTH                      equ 0001h
ANCON1_PCFG9_MASK                        equ 0002h
ANCON1_PCFG10_POSN                       equ 0002h
ANCON1_PCFG10_POSITION                   equ 0002h
ANCON1_PCFG10_SIZE                       equ 0001h
ANCON1_PCFG10_LENGTH                     equ 0001h
ANCON1_PCFG10_MASK                       equ 0004h
ANCON1_PCFG11_POSN                       equ 0003h
ANCON1_PCFG11_POSITION                   equ 0003h
ANCON1_PCFG11_SIZE                       equ 0001h
ANCON1_PCFG11_LENGTH                     equ 0001h
ANCON1_PCFG11_MASK                       equ 0008h

// Register: ANCON0
#define ANCON0 ANCON0
ANCON0                                   equ 0F25h
// bitfield definitions
ANCON0_ANSEL0_POSN                       equ 0000h
ANCON0_ANSEL0_POSITION                   equ 0000h
ANCON0_ANSEL0_SIZE                       equ 0001h
ANCON0_ANSEL0_LENGTH                     equ 0001h
ANCON0_ANSEL0_MASK                       equ 0001h
ANCON0_ANSEL1_POSN                       equ 0001h
ANCON0_ANSEL1_POSITION                   equ 0001h
ANCON0_ANSEL1_SIZE                       equ 0001h
ANCON0_ANSEL1_LENGTH                     equ 0001h
ANCON0_ANSEL1_MASK                       equ 0002h
ANCON0_ANSEL2_POSN                       equ 0002h
ANCON0_ANSEL2_POSITION                   equ 0002h
ANCON0_ANSEL2_SIZE                       equ 0001h
ANCON0_ANSEL2_LENGTH                     equ 0001h
ANCON0_ANSEL2_MASK                       equ 0004h
ANCON0_ANSEL3_POSN                       equ 0003h
ANCON0_ANSEL3_POSITION                   equ 0003h
ANCON0_ANSEL3_SIZE                       equ 0001h
ANCON0_ANSEL3_LENGTH                     equ 0001h
ANCON0_ANSEL3_MASK                       equ 0008h
ANCON0_ANSEL4_POSN                       equ 0004h
ANCON0_ANSEL4_POSITION                   equ 0004h
ANCON0_ANSEL4_SIZE                       equ 0001h
ANCON0_ANSEL4_LENGTH                     equ 0001h
ANCON0_ANSEL4_MASK                       equ 0010h
ANCON0_ANSEL5_POSN                       equ 0005h
ANCON0_ANSEL5_POSITION                   equ 0005h
ANCON0_ANSEL5_SIZE                       equ 0001h
ANCON0_ANSEL5_LENGTH                     equ 0001h
ANCON0_ANSEL5_MASK                       equ 0020h
ANCON0_ANSEL6_POSN                       equ 0006h
ANCON0_ANSEL6_POSITION                   equ 0006h
ANCON0_ANSEL6_SIZE                       equ 0001h
ANCON0_ANSEL6_LENGTH                     equ 0001h
ANCON0_ANSEL6_MASK                       equ 0040h
ANCON0_ANSEL7_POSN                       equ 0007h
ANCON0_ANSEL7_POSITION                   equ 0007h
ANCON0_ANSEL7_SIZE                       equ 0001h
ANCON0_ANSEL7_LENGTH                     equ 0001h
ANCON0_ANSEL7_MASK                       equ 0080h
ANCON0_PCFG0_POSN                        equ 0000h
ANCON0_PCFG0_POSITION                    equ 0000h
ANCON0_PCFG0_SIZE                        equ 0001h
ANCON0_PCFG0_LENGTH                      equ 0001h
ANCON0_PCFG0_MASK                        equ 0001h
ANCON0_PCFG1_POSN                        equ 0001h
ANCON0_PCFG1_POSITION                    equ 0001h
ANCON0_PCFG1_SIZE                        equ 0001h
ANCON0_PCFG1_LENGTH                      equ 0001h
ANCON0_PCFG1_MASK                        equ 0002h
ANCON0_PCFG2_POSN                        equ 0002h
ANCON0_PCFG2_POSITION                    equ 0002h
ANCON0_PCFG2_SIZE                        equ 0001h
ANCON0_PCFG2_LENGTH                      equ 0001h
ANCON0_PCFG2_MASK                        equ 0004h
ANCON0_PCFG3_POSN                        equ 0003h
ANCON0_PCFG3_POSITION                    equ 0003h
ANCON0_PCFG3_SIZE                        equ 0001h
ANCON0_PCFG3_LENGTH                      equ 0001h
ANCON0_PCFG3_MASK                        equ 0008h
ANCON0_PCFG4_POSN                        equ 0004h
ANCON0_PCFG4_POSITION                    equ 0004h
ANCON0_PCFG4_SIZE                        equ 0001h
ANCON0_PCFG4_LENGTH                      equ 0001h
ANCON0_PCFG4_MASK                        equ 0010h
ANCON0_PCFG5_POSN                        equ 0005h
ANCON0_PCFG5_POSITION                    equ 0005h
ANCON0_PCFG5_SIZE                        equ 0001h
ANCON0_PCFG5_LENGTH                      equ 0001h
ANCON0_PCFG5_MASK                        equ 0020h
ANCON0_PCFG6_POSN                        equ 0006h
ANCON0_PCFG6_POSITION                    equ 0006h
ANCON0_PCFG6_SIZE                        equ 0001h
ANCON0_PCFG6_LENGTH                      equ 0001h
ANCON0_PCFG6_MASK                        equ 0040h
ANCON0_PCFG7_POSN                        equ 0007h
ANCON0_PCFG7_POSITION                    equ 0007h
ANCON0_PCFG7_SIZE                        equ 0001h
ANCON0_PCFG7_LENGTH                      equ 0001h
ANCON0_PCFG7_MASK                        equ 0080h

// Register: ODCON3
#define ODCON3 ODCON3
ODCON3                                   equ 0F27h
// bitfield definitions
ODCON3_CTMUDS_POSN                       equ 0000h
ODCON3_CTMUDS_POSITION                   equ 0000h
ODCON3_CTMUDS_SIZE                       equ 0001h
ODCON3_CTMUDS_LENGTH                     equ 0001h
ODCON3_CTMUDS_MASK                       equ 0001h
ODCON3_U1OD_POSN                         equ 0006h
ODCON3_U1OD_POSITION                     equ 0006h
ODCON3_U1OD_SIZE                         equ 0001h
ODCON3_U1OD_LENGTH                       equ 0001h
ODCON3_U1OD_MASK                         equ 0040h
ODCON3_U2OD_POSN                         equ 0007h
ODCON3_U2OD_POSITION                     equ 0007h
ODCON3_U2OD_SIZE                         equ 0001h
ODCON3_U2OD_LENGTH                       equ 0001h
ODCON3_U2OD_MASK                         equ 0080h

// Register: ODCON2
#define ODCON2 ODCON2
ODCON2                                   equ 0F28h
// bitfield definitions
ODCON2_CCP3OD_POSN                       equ 0000h
ODCON2_CCP3OD_POSITION                   equ 0000h
ODCON2_CCP3OD_SIZE                       equ 0001h
ODCON2_CCP3OD_LENGTH                     equ 0001h
ODCON2_CCP3OD_MASK                       equ 0001h
ODCON2_CCP4OD_POSN                       equ 0001h
ODCON2_CCP4OD_POSITION                   equ 0001h
ODCON2_CCP4OD_SIZE                       equ 0001h
ODCON2_CCP4OD_LENGTH                     equ 0001h
ODCON2_CCP4OD_MASK                       equ 0002h
ODCON2_CCP5OD_POSN                       equ 0002h
ODCON2_CCP5OD_POSITION                   equ 0002h
ODCON2_CCP5OD_SIZE                       equ 0001h
ODCON2_CCP5OD_LENGTH                     equ 0001h
ODCON2_CCP5OD_MASK                       equ 0004h
ODCON2_CCP6OD_POSN                       equ 0003h
ODCON2_CCP6OD_POSITION                   equ 0003h
ODCON2_CCP6OD_SIZE                       equ 0001h
ODCON2_CCP6OD_LENGTH                     equ 0001h
ODCON2_CCP6OD_MASK                       equ 0008h
ODCON2_CCP7OD_POSN                       equ 0004h
ODCON2_CCP7OD_POSITION                   equ 0004h
ODCON2_CCP7OD_SIZE                       equ 0001h
ODCON2_CCP7OD_LENGTH                     equ 0001h
ODCON2_CCP7OD_MASK                       equ 0010h
ODCON2_CCP8OD_POSN                       equ 0005h
ODCON2_CCP8OD_POSITION                   equ 0005h
ODCON2_CCP8OD_SIZE                       equ 0001h
ODCON2_CCP8OD_LENGTH                     equ 0001h
ODCON2_CCP8OD_MASK                       equ 0020h
ODCON2_CCP9OD_POSN                       equ 0006h
ODCON2_CCP9OD_POSITION                   equ 0006h
ODCON2_CCP9OD_SIZE                       equ 0001h
ODCON2_CCP9OD_LENGTH                     equ 0001h
ODCON2_CCP9OD_MASK                       equ 0040h
ODCON2_CCP10OD_POSN                      equ 0007h
ODCON2_CCP10OD_POSITION                  equ 0007h
ODCON2_CCP10OD_SIZE                      equ 0001h
ODCON2_CCP10OD_LENGTH                    equ 0001h
ODCON2_CCP10OD_MASK                      equ 0080h

// Register: ODCON1
#define ODCON1 ODCON1
ODCON1                                   equ 0F29h
// bitfield definitions
ODCON1_SPI2OD_POSN                       equ 0000h
ODCON1_SPI2OD_POSITION                   equ 0000h
ODCON1_SPI2OD_SIZE                       equ 0001h
ODCON1_SPI2OD_LENGTH                     equ 0001h
ODCON1_SPI2OD_MASK                       equ 0001h
ODCON1_CCP1OD_POSN                       equ 0005h
ODCON1_CCP1OD_POSITION                   equ 0005h
ODCON1_CCP1OD_SIZE                       equ 0001h
ODCON1_CCP1OD_LENGTH                     equ 0001h
ODCON1_CCP1OD_MASK                       equ 0020h
ODCON1_CCP2OD_POSN                       equ 0006h
ODCON1_CCP2OD_POSITION                   equ 0006h
ODCON1_CCP2OD_SIZE                       equ 0001h
ODCON1_CCP2OD_LENGTH                     equ 0001h
ODCON1_CCP2OD_MASK                       equ 0040h
ODCON1_SPI1OD_POSN                       equ 0007h
ODCON1_SPI1OD_POSITION                   equ 0007h
ODCON1_SPI1OD_SIZE                       equ 0001h
ODCON1_SPI1OD_LENGTH                     equ 0001h
ODCON1_SPI1OD_MASK                       equ 0080h

// Register: REFOCON
#define REFOCON REFOCON
REFOCON                                  equ 0F2Ah
// bitfield definitions
REFOCON_RODIV_POSN                       equ 0000h
REFOCON_RODIV_POSITION                   equ 0000h
REFOCON_RODIV_SIZE                       equ 0004h
REFOCON_RODIV_LENGTH                     equ 0004h
REFOCON_RODIV_MASK                       equ 000Fh
REFOCON_ROSEL_POSN                       equ 0004h
REFOCON_ROSEL_POSITION                   equ 0004h
REFOCON_ROSEL_SIZE                       equ 0001h
REFOCON_ROSEL_LENGTH                     equ 0001h
REFOCON_ROSEL_MASK                       equ 0010h
REFOCON_ROSSLP_POSN                      equ 0005h
REFOCON_ROSSLP_POSITION                  equ 0005h
REFOCON_ROSSLP_SIZE                      equ 0001h
REFOCON_ROSSLP_LENGTH                    equ 0001h
REFOCON_ROSSLP_MASK                      equ 0020h
REFOCON_ROON_POSN                        equ 0007h
REFOCON_ROON_POSITION                    equ 0007h
REFOCON_ROON_SIZE                        equ 0001h
REFOCON_ROON_LENGTH                      equ 0001h
REFOCON_ROON_MASK                        equ 0080h
REFOCON_RODIV0_POSN                      equ 0000h
REFOCON_RODIV0_POSITION                  equ 0000h
REFOCON_RODIV0_SIZE                      equ 0001h
REFOCON_RODIV0_LENGTH                    equ 0001h
REFOCON_RODIV0_MASK                      equ 0001h
REFOCON_RODIV1_POSN                      equ 0001h
REFOCON_RODIV1_POSITION                  equ 0001h
REFOCON_RODIV1_SIZE                      equ 0001h
REFOCON_RODIV1_LENGTH                    equ 0001h
REFOCON_RODIV1_MASK                      equ 0002h
REFOCON_RODIV2_POSN                      equ 0002h
REFOCON_RODIV2_POSITION                  equ 0002h
REFOCON_RODIV2_SIZE                      equ 0001h
REFOCON_RODIV2_LENGTH                    equ 0001h
REFOCON_RODIV2_MASK                      equ 0004h
REFOCON_RODIV3_POSN                      equ 0003h
REFOCON_RODIV3_POSITION                  equ 0003h
REFOCON_RODIV3_SIZE                      equ 0001h
REFOCON_RODIV3_LENGTH                    equ 0001h
REFOCON_RODIV3_MASK                      equ 0008h

// Register: CCPTMRS2
#define CCPTMRS2 CCPTMRS2
CCPTMRS2                                 equ 0F2Bh
// bitfield definitions
CCPTMRS2_C8TSEL_POSN                     equ 0000h
CCPTMRS2_C8TSEL_POSITION                 equ 0000h
CCPTMRS2_C8TSEL_SIZE                     equ 0002h
CCPTMRS2_C8TSEL_LENGTH                   equ 0002h
CCPTMRS2_C8TSEL_MASK                     equ 0003h
CCPTMRS2_C9TSEL0_POSN                    equ 0002h
CCPTMRS2_C9TSEL0_POSITION                equ 0002h
CCPTMRS2_C9TSEL0_SIZE                    equ 0001h
CCPTMRS2_C9TSEL0_LENGTH                  equ 0001h
CCPTMRS2_C9TSEL0_MASK                    equ 0004h
CCPTMRS2_C10TSEL0_POSN                   equ 0004h
CCPTMRS2_C10TSEL0_POSITION               equ 0004h
CCPTMRS2_C10TSEL0_SIZE                   equ 0001h
CCPTMRS2_C10TSEL0_LENGTH                 equ 0001h
CCPTMRS2_C10TSEL0_MASK                   equ 0010h
CCPTMRS2_C8TSEL0_POSN                    equ 0000h
CCPTMRS2_C8TSEL0_POSITION                equ 0000h
CCPTMRS2_C8TSEL0_SIZE                    equ 0001h
CCPTMRS2_C8TSEL0_LENGTH                  equ 0001h
CCPTMRS2_C8TSEL0_MASK                    equ 0001h
CCPTMRS2_C8TSEL1_POSN                    equ 0001h
CCPTMRS2_C8TSEL1_POSITION                equ 0001h
CCPTMRS2_C8TSEL1_SIZE                    equ 0001h
CCPTMRS2_C8TSEL1_LENGTH                  equ 0001h
CCPTMRS2_C8TSEL1_MASK                    equ 0002h

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
CCPTMRS1                                 equ 0F2Ch
// bitfield definitions
CCPTMRS1_C4TSEL_POSN                     equ 0000h
CCPTMRS1_C4TSEL_POSITION                 equ 0000h
CCPTMRS1_C4TSEL_SIZE                     equ 0002h
CCPTMRS1_C4TSEL_LENGTH                   equ 0002h
CCPTMRS1_C4TSEL_MASK                     equ 0003h
CCPTMRS1_C5TSEL0_POSN                    equ 0002h
CCPTMRS1_C5TSEL0_POSITION                equ 0002h
CCPTMRS1_C5TSEL0_SIZE                    equ 0001h
CCPTMRS1_C5TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C5TSEL0_MASK                    equ 0004h
CCPTMRS1_C6TSEL0_POSN                    equ 0004h
CCPTMRS1_C6TSEL0_POSITION                equ 0004h
CCPTMRS1_C6TSEL0_SIZE                    equ 0001h
CCPTMRS1_C6TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C6TSEL0_MASK                    equ 0010h
CCPTMRS1_C7TSEL_POSN                     equ 0006h
CCPTMRS1_C7TSEL_POSITION                 equ 0006h
CCPTMRS1_C7TSEL_SIZE                     equ 0002h
CCPTMRS1_C7TSEL_LENGTH                   equ 0002h
CCPTMRS1_C7TSEL_MASK                     equ 00C0h
CCPTMRS1_C4TSEL0_POSN                    equ 0000h
CCPTMRS1_C4TSEL0_POSITION                equ 0000h
CCPTMRS1_C4TSEL0_SIZE                    equ 0001h
CCPTMRS1_C4TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C4TSEL0_MASK                    equ 0001h
CCPTMRS1_C4TSEL1_POSN                    equ 0001h
CCPTMRS1_C4TSEL1_POSITION                equ 0001h
CCPTMRS1_C4TSEL1_SIZE                    equ 0001h
CCPTMRS1_C4TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C4TSEL1_MASK                    equ 0002h
CCPTMRS1_C7TSEL0_POSN                    equ 0006h
CCPTMRS1_C7TSEL0_POSITION                equ 0006h
CCPTMRS1_C7TSEL0_SIZE                    equ 0001h
CCPTMRS1_C7TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL0_MASK                    equ 0040h
CCPTMRS1_C7TSEL1_POSN                    equ 0007h
CCPTMRS1_C7TSEL1_POSITION                equ 0007h
CCPTMRS1_C7TSEL1_SIZE                    equ 0001h
CCPTMRS1_C7TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL1_MASK                    equ 0080h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 0F2Dh
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0003h
CCPTMRS0_C1TSEL_LENGTH                   equ 0003h
CCPTMRS0_C1TSEL_MASK                     equ 0007h
CCPTMRS0_C2TSEL_POSN                     equ 0003h
CCPTMRS0_C2TSEL_POSITION                 equ 0003h
CCPTMRS0_C2TSEL_SIZE                     equ 0003h
CCPTMRS0_C2TSEL_LENGTH                   equ 0003h
CCPTMRS0_C2TSEL_MASK                     equ 0038h
CCPTMRS0_C3TSEL_POSN                     equ 0006h
CCPTMRS0_C3TSEL_POSITION                 equ 0006h
CCPTMRS0_C3TSEL_SIZE                     equ 0002h
CCPTMRS0_C3TSEL_LENGTH                   equ 0002h
CCPTMRS0_C3TSEL_MASK                     equ 00C0h
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C1TSEL2_POSN                    equ 0002h
CCPTMRS0_C1TSEL2_POSITION                equ 0002h
CCPTMRS0_C1TSEL2_SIZE                    equ 0001h
CCPTMRS0_C1TSEL2_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL2_MASK                    equ 0004h
CCPTMRS0_C2TSEL0_POSN                    equ 0003h
CCPTMRS0_C2TSEL0_POSITION                equ 0003h
CCPTMRS0_C2TSEL0_SIZE                    equ 0001h
CCPTMRS0_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL0_MASK                    equ 0008h
CCPTMRS0_C2TSEL1_POSN                    equ 0004h
CCPTMRS0_C2TSEL1_POSITION                equ 0004h
CCPTMRS0_C2TSEL1_SIZE                    equ 0001h
CCPTMRS0_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL1_MASK                    equ 0010h
CCPTMRS0_C2TSEL2_POSN                    equ 0005h
CCPTMRS0_C2TSEL2_POSITION                equ 0005h
CCPTMRS0_C2TSEL2_SIZE                    equ 0001h
CCPTMRS0_C2TSEL2_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL2_MASK                    equ 0020h
CCPTMRS0_C3TSEL0_POSN                    equ 0006h
CCPTMRS0_C3TSEL0_POSITION                equ 0006h
CCPTMRS0_C3TSEL0_SIZE                    equ 0001h
CCPTMRS0_C3TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL0_MASK                    equ 0040h
CCPTMRS0_C3TSEL1_POSN                    equ 0007h
CCPTMRS0_C3TSEL1_POSITION                equ 0007h
CCPTMRS0_C3TSEL1_SIZE                    equ 0001h
CCPTMRS0_C3TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL1_MASK                    equ 0080h

