GopalSaraf/Practicals/PSDL/include/proc/pic18f67k90.inc
// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 0F60h
// bitfield definitions
PIE6_CMP1IE_POSN                         equ 0000h
PIE6_CMP1IE_POSITION                     equ 0000h
PIE6_CMP1IE_SIZE                         equ 0001h
PIE6_CMP1IE_LENGTH                       equ 0001h
PIE6_CMP1IE_MASK                         equ 0001h
PIE6_CMP2IE_POSN                         equ 0001h
PIE6_CMP2IE_POSITION                     equ 0001h
PIE6_CMP2IE_SIZE                         equ 0001h
PIE6_CMP2IE_LENGTH                       equ 0001h
PIE6_CMP2IE_MASK                         equ 0002h
PIE6_CMP3IE_POSN                         equ 0002h
PIE6_CMP3IE_POSITION                     equ 0002h
PIE6_CMP3IE_SIZE                         equ 0001h
PIE6_CMP3IE_LENGTH                       equ 0001h
PIE6_CMP3IE_MASK                         equ 0004h
PIE6_EEIE_POSN                           equ 0004h
PIE6_EEIE_POSITION                       equ 0004h
PIE6_EEIE_SIZE                           equ 0001h
PIE6_EEIE_LENGTH                         equ 0001h
PIE6_EEIE_MASK                           equ 0010h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 0F61h
// bitfield definitions
EEDATA_EEDATA_POSN                       equ 0000h
EEDATA_EEDATA_POSITION                   equ 0000h
EEDATA_EEDATA_SIZE                       equ 0008h
EEDATA_EEDATA_LENGTH                     equ 0008h
EEDATA_EEDATA_MASK                       equ 00FFh

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 0F62h
// bitfield definitions
EEADR_EEADR_POSN                         equ 0000h
EEADR_EEADR_POSITION                     equ 0000h
EEADR_EEADR_SIZE                         equ 0008h
EEADR_EEADR_LENGTH                       equ 0008h
EEADR_EEADR_MASK                         equ 00FFh

// Register: EEADRH
#define EEADRH EEADRH
EEADRH                                   equ 0F63h
// bitfield definitions
EEADRH_EEADRH_POSN                       equ 0000h
EEADRH_EEADRH_POSITION                   equ 0000h
EEADRH_EEADRH_SIZE                       equ 0002h
EEADRH_EEADRH_LENGTH                     equ 0002h
EEADRH_EEADRH_MASK                       equ 0003h

// Register: OSCCON2
#define OSCCON2 OSCCON2
OSCCON2                                  equ 0F64h
// bitfield definitions
OSCCON2_MFIOSEL_POSN                     equ 0000h
OSCCON2_MFIOSEL_POSITION                 equ 0000h
OSCCON2_MFIOSEL_SIZE                     equ 0001h
OSCCON2_MFIOSEL_LENGTH                   equ 0001h
OSCCON2_MFIOSEL_MASK                     equ 0001h
OSCCON2_MFIOFS_POSN                      equ 0001h
OSCCON2_MFIOFS_POSITION                  equ 0001h
OSCCON2_MFIOFS_SIZE                      equ 0001h
OSCCON2_MFIOFS_LENGTH                    equ 0001h
OSCCON2_MFIOFS_MASK                      equ 0002h
OSCCON2_SOSCGO_POSN                      equ 0003h
OSCCON2_SOSCGO_POSITION                  equ 0003h
OSCCON2_SOSCGO_SIZE                      equ 0001h
OSCCON2_SOSCGO_LENGTH                    equ 0001h
OSCCON2_SOSCGO_MASK                      equ 0008h
OSCCON2_SOSCRUN_POSN                     equ 0006h
OSCCON2_SOSCRUN_POSITION                 equ 0006h
OSCCON2_SOSCRUN_SIZE                     equ 0001h
OSCCON2_SOSCRUN_LENGTH                   equ 0001h
OSCCON2_SOSCRUN_MASK                     equ 0040h

// Register: BAUDCON1
#define BAUDCON1 BAUDCON1
BAUDCON1                                 equ 0F65h
// bitfield definitions
BAUDCON1_ABDEN_POSN                      equ 0000h
BAUDCON1_ABDEN_POSITION                  equ 0000h
BAUDCON1_ABDEN_SIZE                      equ 0001h
BAUDCON1_ABDEN_LENGTH                    equ 0001h
BAUDCON1_ABDEN_MASK                      equ 0001h
BAUDCON1_WUE_POSN                        equ 0001h
BAUDCON1_WUE_POSITION                    equ 0001h
BAUDCON1_WUE_SIZE                        equ 0001h
BAUDCON1_WUE_LENGTH                      equ 0001h
BAUDCON1_WUE_MASK                        equ 0002h
BAUDCON1_BRG16_POSN                      equ 0003h
BAUDCON1_BRG16_POSITION                  equ 0003h
BAUDCON1_BRG16_SIZE                      equ 0001h
BAUDCON1_BRG16_LENGTH                    equ 0001h
BAUDCON1_BRG16_MASK                      equ 0008h
BAUDCON1_TXCKP_POSN                      equ 0004h
BAUDCON1_TXCKP_POSITION                  equ 0004h
BAUDCON1_TXCKP_SIZE                      equ 0001h
BAUDCON1_TXCKP_LENGTH                    equ 0001h
BAUDCON1_TXCKP_MASK                      equ 0010h
BAUDCON1_RXDTP_POSN                      equ 0005h
BAUDCON1_RXDTP_POSITION                  equ 0005h
BAUDCON1_RXDTP_SIZE                      equ 0001h
BAUDCON1_RXDTP_LENGTH                    equ 0001h
BAUDCON1_RXDTP_MASK                      equ 0020h
BAUDCON1_RCIDL_POSN                      equ 0006h
BAUDCON1_RCIDL_POSITION                  equ 0006h
BAUDCON1_RCIDL_SIZE                      equ 0001h
BAUDCON1_RCIDL_LENGTH                    equ 0001h
BAUDCON1_RCIDL_MASK                      equ 0040h
BAUDCON1_ABDOVF_POSN                     equ 0007h
BAUDCON1_ABDOVF_POSITION                 equ 0007h
BAUDCON1_ABDOVF_SIZE                     equ 0001h
BAUDCON1_ABDOVF_LENGTH                   equ 0001h
BAUDCON1_ABDOVF_MASK                     equ 0080h
BAUDCON1_ABDEN1_POSN                     equ 0000h
BAUDCON1_ABDEN1_POSITION                 equ 0000h
BAUDCON1_ABDEN1_SIZE                     equ 0001h
BAUDCON1_ABDEN1_LENGTH                   equ 0001h
BAUDCON1_ABDEN1_MASK                     equ 0001h
BAUDCON1_WUE1_POSN                       equ 0001h
BAUDCON1_WUE1_POSITION                   equ 0001h
BAUDCON1_WUE1_SIZE                       equ 0001h
BAUDCON1_WUE1_LENGTH                     equ 0001h
BAUDCON1_WUE1_MASK                       equ 0002h
BAUDCON1_BRG161_POSN                     equ 0003h
BAUDCON1_BRG161_POSITION                 equ 0003h
BAUDCON1_BRG161_SIZE                     equ 0001h
BAUDCON1_BRG161_LENGTH                   equ 0001h
BAUDCON1_BRG161_MASK                     equ 0008h
BAUDCON1_CKTXP_POSN                      equ 0004h
BAUDCON1_CKTXP_POSITION                  equ 0004h
BAUDCON1_CKTXP_SIZE                      equ 0001h
BAUDCON1_CKTXP_LENGTH                    equ 0001h
BAUDCON1_CKTXP_MASK                      equ 0010h
BAUDCON1_DTRXP_POSN                      equ 0005h
BAUDCON1_DTRXP_POSITION                  equ 0005h
BAUDCON1_DTRXP_SIZE                      equ 0001h
BAUDCON1_DTRXP_LENGTH                    equ 0001h
BAUDCON1_DTRXP_MASK                      equ 0020h
BAUDCON1_RCIDL1_POSN                     equ 0006h
BAUDCON1_RCIDL1_POSITION                 equ 0006h
BAUDCON1_RCIDL1_SIZE                     equ 0001h
BAUDCON1_RCIDL1_LENGTH                   equ 0001h
BAUDCON1_RCIDL1_MASK                     equ 0040h
BAUDCON1_ABDOVF1_POSN                    equ 0007h
BAUDCON1_ABDOVF1_POSITION                equ 0007h
BAUDCON1_ABDOVF1_SIZE                    equ 0001h
BAUDCON1_ABDOVF1_LENGTH                  equ 0001h
BAUDCON1_ABDOVF1_MASK                    equ 0080h
BAUDCON1_SCKP_POSN                       equ 0004h
BAUDCON1_SCKP_POSITION                   equ 0004h
BAUDCON1_SCKP_SIZE                       equ 0001h
BAUDCON1_SCKP_LENGTH                     equ 0001h
BAUDCON1_SCKP_MASK                       equ 0010h
BAUDCON1_DTRXP1_POSN                     equ 0005h
BAUDCON1_DTRXP1_POSITION                 equ 0005h
BAUDCON1_DTRXP1_SIZE                     equ 0001h
BAUDCON1_DTRXP1_LENGTH                   equ 0001h
BAUDCON1_DTRXP1_MASK                     equ 0020h
BAUDCON1_RCMT_POSN                       equ 0006h
BAUDCON1_RCMT_POSITION                   equ 0006h
BAUDCON1_RCMT_SIZE                       equ 0001h
BAUDCON1_RCMT_LENGTH                     equ 0001h
BAUDCON1_RCMT_MASK                       equ 0040h
BAUDCON1_SCKP1_POSN                      equ 0004h
BAUDCON1_SCKP1_POSITION                  equ 0004h
BAUDCON1_SCKP1_SIZE                      equ 0001h
BAUDCON1_SCKP1_LENGTH                    equ 0001h
BAUDCON1_SCKP1_MASK                      equ 0010h
BAUDCON1_RXDTP1_POSN                     equ 0005h
BAUDCON1_RXDTP1_POSITION                 equ 0005h
BAUDCON1_RXDTP1_SIZE                     equ 0001h
BAUDCON1_RXDTP1_LENGTH                   equ 0001h
BAUDCON1_RXDTP1_MASK                     equ 0020h
BAUDCON1_RCMT1_POSN                      equ 0006h
BAUDCON1_RCMT1_POSITION                  equ 0006h
BAUDCON1_RCMT1_SIZE                      equ 0001h
BAUDCON1_RCMT1_LENGTH                    equ 0001h
BAUDCON1_RCMT1_MASK                      equ 0040h
BAUDCON1_TXCKP1_POSN                     equ 0004h
BAUDCON1_TXCKP1_POSITION                 equ 0004h
BAUDCON1_TXCKP1_SIZE                     equ 0001h
BAUDCON1_TXCKP1_LENGTH                   equ 0001h
BAUDCON1_TXCKP1_MASK                     equ 0010h
BAUDCON1_W4E_POSN                        equ 0001h
BAUDCON1_W4E_POSITION                    equ 0001h
BAUDCON1_W4E_SIZE                        equ 0001h
BAUDCON1_W4E_LENGTH                      equ 0001h
BAUDCON1_W4E_MASK                        equ 0002h
BAUDCON1_RXCKP_POSN                      equ 0005h
BAUDCON1_RXCKP_POSITION                  equ 0005h
BAUDCON1_RXCKP_SIZE                      equ 0001h
BAUDCON1_RXCKP_LENGTH                    equ 0001h
BAUDCON1_RXCKP_MASK                      equ 0020h

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
LCDDATA0                                 equ 0F66h
// bitfield definitions
LCDDATA0_S00C0_POSN                      equ 0000h
LCDDATA0_S00C0_POSITION                  equ 0000h
LCDDATA0_S00C0_SIZE                      equ 0001h
LCDDATA0_S00C0_LENGTH                    equ 0001h
LCDDATA0_S00C0_MASK                      equ 0001h
LCDDATA0_S01C0_POSN                      equ 0001h
LCDDATA0_S01C0_POSITION                  equ 0001h
LCDDATA0_S01C0_SIZE                      equ 0001h
LCDDATA0_S01C0_LENGTH                    equ 0001h
LCDDATA0_S01C0_MASK                      equ 0002h
LCDDATA0_S02C0_POSN                      equ 0002h
LCDDATA0_S02C0_POSITION                  equ 0002h
LCDDATA0_S02C0_SIZE                      equ 0001h
LCDDATA0_S02C0_LENGTH                    equ 0001h
LCDDATA0_S02C0_MASK                      equ 0004h
LCDDATA0_S03C0_POSN                      equ 0003h
LCDDATA0_S03C0_POSITION                  equ 0003h
LCDDATA0_S03C0_SIZE                      equ 0001h
LCDDATA0_S03C0_LENGTH                    equ 0001h
LCDDATA0_S03C0_MASK                      equ 0008h
LCDDATA0_S04C0_POSN                      equ 0004h
LCDDATA0_S04C0_POSITION                  equ 0004h
LCDDATA0_S04C0_SIZE                      equ 0001h
LCDDATA0_S04C0_LENGTH                    equ 0001h
LCDDATA0_S04C0_MASK                      equ 0010h
LCDDATA0_S05C0_POSN                      equ 0005h
LCDDATA0_S05C0_POSITION                  equ 0005h
LCDDATA0_S05C0_SIZE                      equ 0001h
LCDDATA0_S05C0_LENGTH                    equ 0001h
LCDDATA0_S05C0_MASK                      equ 0020h
LCDDATA0_S06C0_POSN                      equ 0006h
LCDDATA0_S06C0_POSITION                  equ 0006h
LCDDATA0_S06C0_SIZE                      equ 0001h
LCDDATA0_S06C0_LENGTH                    equ 0001h
LCDDATA0_S06C0_MASK                      equ 0040h
LCDDATA0_S07C0_POSN                      equ 0007h
LCDDATA0_S07C0_POSITION                  equ 0007h
LCDDATA0_S07C0_SIZE                      equ 0001h
LCDDATA0_S07C0_LENGTH                    equ 0001h
LCDDATA0_S07C0_MASK                      equ 0080h

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
LCDDATA1                                 equ 0F67h
// bitfield definitions
LCDDATA1_S08C0_POSN                      equ 0000h
LCDDATA1_S08C0_POSITION                  equ 0000h
LCDDATA1_S08C0_SIZE                      equ 0001h
LCDDATA1_S08C0_LENGTH                    equ 0001h
LCDDATA1_S08C0_MASK                      equ 0001h
LCDDATA1_S09C0_POSN                      equ 0001h
LCDDATA1_S09C0_POSITION                  equ 0001h
LCDDATA1_S09C0_SIZE                      equ 0001h
LCDDATA1_S09C0_LENGTH                    equ 0001h
LCDDATA1_S09C0_MASK                      equ 0002h
LCDDATA1_S10C0_POSN                      equ 0002h
LCDDATA1_S10C0_POSITION                  equ 0002h
LCDDATA1_S10C0_SIZE                      equ 0001h
LCDDATA1_S10C0_LENGTH                    equ 0001h
LCDDATA1_S10C0_MASK                      equ 0004h
LCDDATA1_S11C0_POSN                      equ 0003h
LCDDATA1_S11C0_POSITION                  equ 0003h
LCDDATA1_S11C0_SIZE                      equ 0001h
LCDDATA1_S11C0_LENGTH                    equ 0001h
LCDDATA1_S11C0_MASK                      equ 0008h
LCDDATA1_S12C0_POSN                      equ 0004h
LCDDATA1_S12C0_POSITION                  equ 0004h
LCDDATA1_S12C0_SIZE                      equ 0001h
LCDDATA1_S12C0_LENGTH                    equ 0001h
LCDDATA1_S12C0_MASK                      equ 0010h
LCDDATA1_S13C0_POSN                      equ 0005h
LCDDATA1_S13C0_POSITION                  equ 0005h
LCDDATA1_S13C0_SIZE                      equ 0001h
LCDDATA1_S13C0_LENGTH                    equ 0001h
LCDDATA1_S13C0_MASK                      equ 0020h
LCDDATA1_S14C0_POSN                      equ 0006h
LCDDATA1_S14C0_POSITION                  equ 0006h
LCDDATA1_S14C0_SIZE                      equ 0001h
LCDDATA1_S14C0_LENGTH                    equ 0001h
LCDDATA1_S14C0_MASK                      equ 0040h
LCDDATA1_S15C0_POSN                      equ 0007h
LCDDATA1_S15C0_POSITION                  equ 0007h
LCDDATA1_S15C0_SIZE                      equ 0001h
LCDDATA1_S15C0_LENGTH                    equ 0001h
LCDDATA1_S15C0_MASK                      equ 0080h

// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
LCDDATA2                                 equ 0F68h
// bitfield definitions
LCDDATA2_S16C0_POSN                      equ 0000h
LCDDATA2_S16C0_POSITION                  equ 0000h
LCDDATA2_S16C0_SIZE                      equ 0001h
LCDDATA2_S16C0_LENGTH                    equ 0001h
LCDDATA2_S16C0_MASK                      equ 0001h
LCDDATA2_S17C0_POSN                      equ 0001h
LCDDATA2_S17C0_POSITION                  equ 0001h
LCDDATA2_S17C0_SIZE                      equ 0001h
LCDDATA2_S17C0_LENGTH                    equ 0001h
LCDDATA2_S17C0_MASK                      equ 0002h
LCDDATA2_S18C0_POSN                      equ 0002h
LCDDATA2_S18C0_POSITION                  equ 0002h
LCDDATA2_S18C0_SIZE                      equ 0001h
LCDDATA2_S18C0_LENGTH                    equ 0001h
LCDDATA2_S18C0_MASK                      equ 0004h
LCDDATA2_S19C0_POSN                      equ 0003h
LCDDATA2_S19C0_POSITION                  equ 0003h
LCDDATA2_S19C0_SIZE                      equ 0001h
LCDDATA2_S19C0_LENGTH                    equ 0001h
LCDDATA2_S19C0_MASK                      equ 0008h
LCDDATA2_S20C0_POSN                      equ 0004h
LCDDATA2_S20C0_POSITION                  equ 0004h
LCDDATA2_S20C0_SIZE                      equ 0001h
LCDDATA2_S20C0_LENGTH                    equ 0001h
LCDDATA2_S20C0_MASK                      equ 0010h
LCDDATA2_S21C0_POSN                      equ 0005h
LCDDATA2_S21C0_POSITION                  equ 0005h
LCDDATA2_S21C0_SIZE                      equ 0001h
LCDDATA2_S21C0_LENGTH                    equ 0001h
LCDDATA2_S21C0_MASK                      equ 0020h
LCDDATA2_S22C0_POSN                      equ 0006h
LCDDATA2_S22C0_POSITION                  equ 0006h
LCDDATA2_S22C0_SIZE                      equ 0001h
LCDDATA2_S22C0_LENGTH                    equ 0001h
LCDDATA2_S22C0_MASK                      equ 0040h
LCDDATA2_S23C0_POSN                      equ 0007h
LCDDATA2_S23C0_POSITION                  equ 0007h
LCDDATA2_S23C0_SIZE                      equ 0001h
LCDDATA2_S23C0_LENGTH                    equ 0001h
LCDDATA2_S23C0_MASK                      equ 0080h

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
LCDDATA3                                 equ 0F69h
// bitfield definitions
LCDDATA3_S24C0_POSN                      equ 0000h
LCDDATA3_S24C0_POSITION                  equ 0000h
LCDDATA3_S24C0_SIZE                      equ 0001h
LCDDATA3_S24C0_LENGTH                    equ 0001h
LCDDATA3_S24C0_MASK                      equ 0001h
LCDDATA3_S25C0_POSN                      equ 0001h
LCDDATA3_S25C0_POSITION                  equ 0001h
LCDDATA3_S25C0_SIZE                      equ 0001h
LCDDATA3_S25C0_LENGTH                    equ 0001h
LCDDATA3_S25C0_MASK                      equ 0002h
LCDDATA3_S26C0_POSN                      equ 0002h
LCDDATA3_S26C0_POSITION                  equ 0002h
LCDDATA3_S26C0_SIZE                      equ 0001h
LCDDATA3_S26C0_LENGTH                    equ 0001h
LCDDATA3_S26C0_MASK                      equ 0004h
LCDDATA3_S27C0_POSN                      equ 0003h
LCDDATA3_S27C0_POSITION                  equ 0003h
LCDDATA3_S27C0_SIZE                      equ 0001h
LCDDATA3_S27C0_LENGTH                    equ 0001h
LCDDATA3_S27C0_MASK                      equ 0008h
LCDDATA3_S28C0_POSN                      equ 0004h
LCDDATA3_S28C0_POSITION                  equ 0004h
LCDDATA3_S28C0_SIZE                      equ 0001h
LCDDATA3_S28C0_LENGTH                    equ 0001h
LCDDATA3_S28C0_MASK                      equ 0010h
LCDDATA3_S29C0_POSN                      equ 0005h
LCDDATA3_S29C0_POSITION                  equ 0005h
LCDDATA3_S29C0_SIZE                      equ 0001h
LCDDATA3_S29C0_LENGTH                    equ 0001h
LCDDATA3_S29C0_MASK                      equ 0020h
LCDDATA3_S30C0_POSN                      equ 0006h
LCDDATA3_S30C0_POSITION                  equ 0006h
LCDDATA3_S30C0_SIZE                      equ 0001h
LCDDATA3_S30C0_LENGTH                    equ 0001h
LCDDATA3_S30C0_MASK                      equ 0040h
LCDDATA3_S31C0_POSN                      equ 0007h
LCDDATA3_S31C0_POSITION                  equ 0007h
LCDDATA3_S31C0_SIZE                      equ 0001h
LCDDATA3_S31C0_LENGTH                    equ 0001h
LCDDATA3_S31C0_MASK                      equ 0080h

