GopalSaraf/Practicals/PSDL/include/proc/pic18f67k90.inc
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, b
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSP1STAT), 5, a
#define NOT_A2                           BANKMASK(SSP2STAT), 5, b
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, b
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_CM                           BANKMASK(RCON), 5, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RC8                          BANKMASK(RCSTA1), 6, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5DONE                       BANKMASK(T5GCON), 3, b
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, b
#define NOT_T7DONE                       BANKMASK(T7GCON), 3, b
#define NOT_T7SYNC                       BANKMASK(T7CON), 2, b
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_TX8                          BANKMASK(TXSTA1), 6, a
#define NOT_W                            BANKMASK(SSP1STAT), 2, a
#define NOT_W2                           BANKMASK(SSP2STAT), 2, b
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, b
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, b
#define OSC1                             BANKMASK(PORTA), 7, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define P2                               BANKMASK(SSP2STAT), 4, b
#define P2DC0                            BANKMASK(ECCP2DEL), 0, b
#define P2DC02                           BANKMASK(PSTR2CON), 0, b
#define P2DC0CON                         BANKMASK(PSTR2CON), 0, b
#define P2DC1                            BANKMASK(ECCP2DEL), 1, b
#define P2DC12                           BANKMASK(PSTR2CON), 1, b
#define P2DC1CON                         BANKMASK(PSTR2CON), 1, b
#define P2DC2                            BANKMASK(ECCP2DEL), 2, b
#define P2DC22                           BANKMASK(PSTR2CON), 2, b
#define P2DC2CON                         BANKMASK(PSTR2CON), 2, b
#define P2DC3                            BANKMASK(ECCP2DEL), 3, b
#define P2DC32                           BANKMASK(PSTR2CON), 3, b
#define P2DC3CON                         BANKMASK(PSTR2CON), 3, b
#define P2DC4                            BANKMASK(ECCP2DEL), 4, b
#define P2DC42                           BANKMASK(PSTR2CON), 4, b
#define P2DC4CON                         BANKMASK(PSTR2CON), 4, b
#define P2DC5                            BANKMASK(ECCP2DEL), 5, b
#define P2DC6                            BANKMASK(ECCP2DEL), 6, b
#define P2DC62                           BANKMASK(PSTR2CON), 6, b
#define P2DC6CON                         BANKMASK(PSTR2CON), 6, b
#define P2M0                             BANKMASK(CCP2CON), 6, b
#define P2M1                             BANKMASK(CCP2CON), 7, b
#define P2RSEN                           BANKMASK(ECCP2DEL), 7, b
#define P3DC0                            BANKMASK(ECCP3DEL), 0, b
#define P3DC1                            BANKMASK(ECCP3DEL), 1, b
#define P3DC2                            BANKMASK(ECCP3DEL), 2, b
#define P3DC3                            BANKMASK(ECCP3DEL), 3, b
#define P3DC4                            BANKMASK(ECCP3DEL), 4, b
#define P3DC5                            BANKMASK(ECCP3DEL), 5, b
#define P3DC6                            BANKMASK(ECCP3DEL), 6, b
#define P3M0                             BANKMASK(CCP3CON), 6, b
#define P3M1                             BANKMASK(CCP3CON), 7, b
#define P3RSEN                           BANKMASK(ECCP3DEL), 7, b
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2E                             BANKMASK(PORTE), 7, a
#define PA3                              BANKMASK(PORTG), 0, a
#define PB1                              BANKMASK(PORTE), 6, a
#define PB1E                             BANKMASK(PORTE), 6, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PB3                              BANKMASK(PORTE), 4, a
#define PB3E                             BANKMASK(PORTE), 4, a
#define PC1                              BANKMASK(PORTE), 5, a
#define PC1E                             BANKMASK(PORTE), 5, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3                              BANKMASK(PORTE), 3, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG0                            BANKMASK(ANCON0), 0, b
#define PCFG1                            BANKMASK(ANCON0), 1, b
#define PCFG10                           BANKMASK(ANCON1), 2, b
#define PCFG11                           BANKMASK(ANCON1), 3, b
#define PCFG16                           BANKMASK(ANCON2), 0, b
#define PCFG17                           BANKMASK(ANCON2), 1, b
#define PCFG18                           BANKMASK(ANCON2), 2, b
#define PCFG19                           BANKMASK(ANCON2), 3, b
#define PCFG2                            BANKMASK(ANCON0), 2, b
#define PCFG3                            BANKMASK(ANCON0), 3, b
#define PCFG4                            BANKMASK(ANCON0), 4, b
#define PCFG5                            BANKMASK(ANCON0), 5, b
#define PCFG6                            BANKMASK(ANCON0), 6, b
#define PCFG7                            BANKMASK(ANCON0), 7, b
#define PCFG8                            BANKMASK(ANCON1), 0, b
#define PCFG9                            BANKMASK(ANCON1), 1, b
#define PD                               BANKMASK(RCON), 2, a
#define PD1                              BANKMASK(PORTG), 4, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PD3                              BANKMASK(PORTG), 3, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, b
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PGM                              BANKMASK(PORTB), 5, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define POR                              BANKMASK(RCON), 1, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSP0                             BANKMASK(PORTD), 0, a
#define PSP1                             BANKMASK(PORTD), 1, a
#define PSP2                             BANKMASK(PORTD), 2, a
#define PSP3                             BANKMASK(PORTD), 3, a
#define PSP4                             BANKMASK(PORTD), 4, a
#define PSP5                             BANKMASK(PORTD), 5, a
#define PSP6                             BANKMASK(PORTD), 6, a
#define PSP7                             BANKMASK(PORTD), 7, a
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define PSS2AC0                          BANKMASK(ECCP2AS), 2, b
#define PSS2AC1                          BANKMASK(ECCP2AS), 3, b
#define PSS2BD0                          BANKMASK(ECCP2AS), 0, b
#define PSS2BD1                          BANKMASK(ECCP2AS), 1, b
#define PSS3AC0                          BANKMASK(ECCP3AS), 2, b
#define PSS3AC1                          BANKMASK(ECCP3AS), 3, b
#define PSS3BD0                          BANKMASK(ECCP3AS), 0, b
#define PSS3BD1                          BANKMASK(ECCP3AS), 1, b
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA4                              BANKMASK(PORTA), 4, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0                              BANKMASK(PORTB), 0, a
#define RB1                              BANKMASK(PORTB), 1, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC3                              BANKMASK(PORTC), 3, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC8_92                           BANKMASK(RCSTA2), 6, b
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, b
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCD82                            BANKMASK(RCSTA2), 0, b
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCEN2                            BANKMASK(SSP2CON2), 3, b
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, b
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT                             BANKMASK(BAUDCON1), 6, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, b
#define RD0                              BANKMASK(PORTD), 0, a
#define RD1                              BANKMASK(PORTD), 1, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RD165                            BANKMASK(T5CON), 1, b
#define RD167                            BANKMASK(T7CON), 1, b
#define RD2                              BANKMASK(PORTD), 2, a
#define RD3                              BANKMASK(PORTD), 3, a
#define RD4                              BANKMASK(PORTD), 4, a
#define RD5                              BANKMASK(PORTD), 5, a
#define RD6                              BANKMASK(PORTD), 6, a
#define RD7                              BANKMASK(PORTD), 7, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RDPU                             BANKMASK(PADCFG1), 7, b
#define RE0                              BANKMASK(PORTE), 0, a
#define RE1                              BANKMASK(PORTE), 1, a
#define RE2                              BANKMASK(PORTE), 2, a
#define RE3                              BANKMASK(PORTE), 3, a
#define RE4                              BANKMASK(PORTE), 4, a
#define RE5                              BANKMASK(PORTE), 5, a
#define RE6                              BANKMASK(PORTE), 6, a
#define RE7                              BANKMASK(PORTE), 7, a
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2, b
#define REFO                             BANKMASK(PORTE), 4, a
#define REGSLP                           BANKMASK(WDTCON), 7, a
#define REPU                             BANKMASK(PADCFG1), 6, b
#define RF1                              BANKMASK(PORTF), 1, a
#define RF2                              BANKMASK(PORTF), 2, a
#define RF3                              BANKMASK(PORTF), 3, a
#define RF4                              BANKMASK(PORTF), 4, a
#define RF5                              BANKMASK(PORTF), 5, a
#define RF6                              BANKMASK(PORTF), 6, a
#define RF7                              BANKMASK(PORTF), 7, a
#define RG0                              BANKMASK(PORTG), 0, a
#define RG1                              BANKMASK(PORTG), 1, a
#define RG2                              BANKMASK(PORTG), 2, a
#define RG3                              BANKMASK(PORTG), 3, a
#define RG4                              BANKMASK(PORTG), 4, a
#define RG5                              BANKMASK(PORTG), 5, a
#define RI                               BANKMASK(RCON), 4, a
#define RODIV0                           BANKMASK(REFOCON), 0, b
#define RODIV1                           BANKMASK(REFOCON), 1, b
#define RODIV2                           BANKMASK(REFOCON), 2, b
#define RODIV3                           BANKMASK(REFOCON), 3, b
#define ROON                             BANKMASK(REFOCON), 7, b
#define ROSEL                            BANKMASK(REFOCON), 4, b
#define ROSSLP                           BANKMASK(REFOCON), 5, b
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RSEN2                            BANKMASK(SSP2CON2), 1, b
#define RTCC                             BANKMASK(PORTG), 4, a
#define RTCCIE                           BANKMASK(PIE3), 0, a
#define RTCCIF                           BANKMASK(PIR3), 0, a
#define RTCCIP                           BANKMASK(IPR3), 0, a
#define RTCCMD                           BANKMASK(PMD1), 5, b
#define RTCEN                            BANKMASK(RTCCFG), 7, b
#define RTCOE                            BANKMASK(RTCCFG), 2, b
#define RTCPTR0                          BANKMASK(RTCCFG), 0, b
#define RTCPTR1                          BANKMASK(RTCCFG), 1, b
#define RTCSYNC                          BANKMASK(RTCCFG), 4, b
#define RTCWREN                          BANKMASK(RTCCFG), 5, b
#define RTSECSEL0                        BANKMASK(PADCFG1), 1, b
#define RTSECSEL1                        BANKMASK(PADCFG1), 2, b
#define RW                               BANKMASK(SSP1STAT), 2, a
#define RW1                              BANKMASK(SSP1STAT), 2, a
#define RW2                              BANKMASK(SSP2STAT), 2, b
#define RX1                              BANKMASK(PORTC), 7, a
#define RX2                              BANKMASK(PORTG), 2, a
#define RX91                             BANKMASK(RCSTA1), 6, a
#define RX92                             BANKMASK(RCSTA2), 6, b
#define RX9D1                            BANKMASK(RCSTA1), 0, a
#define RX9D2                            BANKMASK(RCSTA2), 0, b
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXCKP                            BANKMASK(BAUDCON1), 5, a
#define RXDTP1                           BANKMASK(BAUDCON1), 5, a
#define RXDTP2                           BANKMASK(BAUDCON2), 5, b
#define R_NOT_W2                         BANKMASK(SSP2STAT), 2, b
#define R_W2                             BANKMASK(SSP2STAT), 2, b
#define R_nW2                            BANKMASK(SSP2STAT), 2, b
#define S00C0                            BANKMASK(LCDDATA0), 0, a
#define S00C1                            BANKMASK(LCDDATA6), 0, a
#define S00C2                            BANKMASK(LCDDATA12), 0, a
#define S00C3                            BANKMASK(LCDDATA18), 0, a
#define S01C0                            BANKMASK(LCDDATA0), 1, a
#define S01C1                            BANKMASK(LCDDATA6), 1, a
#define S01C2                            BANKMASK(LCDDATA12), 1, a
#define S01C3                            BANKMASK(LCDDATA18), 1, a
#define S02C0                            BANKMASK(LCDDATA0), 2, a
#define S02C1                            BANKMASK(LCDDATA6), 2, a
#define S02C2                            BANKMASK(LCDDATA12), 2, a
#define S02C3                            BANKMASK(LCDDATA18), 2, a
#define S03C0                            BANKMASK(LCDDATA0), 3, a
#define S03C1                            BANKMASK(LCDDATA6), 3, a
#define S03C2                            BANKMASK(LCDDATA12), 3, a
#define S03C3                            BANKMASK(LCDDATA18), 3, a
#define S04C0                            BANKMASK(LCDDATA0), 4, a
#define S04C1                            BANKMASK(LCDDATA6), 4, a
#define S04C2                            BANKMASK(LCDDATA12), 4, a
#define S04C3                            BANKMASK(LCDDATA18), 4, a
#define S05C0                            BANKMASK(LCDDATA0), 5, a
#define S05C1                            BANKMASK(LCDDATA6), 5, a
#define S05C2                            BANKMASK(LCDDATA12), 5, a
#define S05C3                            BANKMASK(LCDDATA18), 5, a
#define S06C0                            BANKMASK(LCDDATA0), 6, a
#define S06C1                            BANKMASK(LCDDATA6), 6, a
#define S06C2                            BANKMASK(LCDDATA12), 6, a
#define S06C3                            BANKMASK(LCDDATA18), 6, a
#define S07C0                            BANKMASK(LCDDATA0), 7, a
#define S07C1                            BANKMASK(LCDDATA6), 7, a
#define S07C2                            BANKMASK(LCDDATA12), 7, a
#define S07C3                            BANKMASK(LCDDATA18), 7, a
#define S08C0                            BANKMASK(LCDDATA1), 0, a
#define S08C1                            BANKMASK(LCDDATA7), 0, a
#define S08C2                            BANKMASK(LCDDATA13), 0, a
#define S08C3                            BANKMASK(LCDDATA19), 0, a
#define S09C0                            BANKMASK(LCDDATA1), 1, a
#define S09C1                            BANKMASK(LCDDATA7), 1, a
#define S09C2                            BANKMASK(LCDDATA13), 1, a
#define S09C3                            BANKMASK(LCDDATA19), 1, a
#define S10C0                            BANKMASK(LCDDATA1), 2, a
#define S10C1                            BANKMASK(LCDDATA7), 2, a
#define S10C2                            BANKMASK(LCDDATA13), 2, a
#define S10C3                            BANKMASK(LCDDATA19), 2, a
#define S11C0                            BANKMASK(LCDDATA1), 3, a
#define S11C1                            BANKMASK(LCDDATA7), 3, a
#define S11C2                            BANKMASK(LCDDATA13), 3, a
#define S11C3                            BANKMASK(LCDDATA19), 3, a
#define S12C0                            BANKMASK(LCDDATA1), 4, a
#define S12C1                            BANKMASK(LCDDATA7), 4, a
#define S12C2                            BANKMASK(LCDDATA13), 4, a
#define S12C3                            BANKMASK(LCDDATA19), 4, a
#define S13C0                            BANKMASK(LCDDATA1), 5, a
#define S13C1                            BANKMASK(LCDDATA7), 5, a
#define S13C2                            BANKMASK(LCDDATA13), 5, a
#define S13C3                            BANKMASK(LCDDATA19), 5, a
#define S14C0                            BANKMASK(LCDDATA1), 6, a
#define S14C1                            BANKMASK(LCDDATA7), 6, a
#define S14C2                            BANKMASK(LCDDATA13), 6, a
#define S14C3                            BANKMASK(LCDDATA19), 6, a
#define S15C0                            BANKMASK(LCDDATA1), 7, a
#define S15C1                            BANKMASK(LCDDATA7), 7, a
#define S15C2                            BANKMASK(LCDDATA13), 7, a
#define S15C3                            BANKMASK(LCDDATA19), 7, a
#define S16C0                            BANKMASK(LCDDATA2), 0, a
#define S16C1                            BANKMASK(LCDDATA8), 0, a
#define S16C2                            BANKMASK(LCDDATA14), 0, a
#define S16C3                            BANKMASK(LCDDATA20), 0, a
#define S17C0                            BANKMASK(LCDDATA2), 1, a
#define S17C1                            BANKMASK(LCDDATA8), 1, a
#define S17C2                            BANKMASK(LCDDATA14), 1, a
#define S17C3                            BANKMASK(LCDDATA20), 1, a
#define S18C0                            BANKMASK(LCDDATA2), 2, a
#define S18C1                            BANKMASK(LCDDATA8), 2, a
#define S18C2                            BANKMASK(LCDDATA14), 2, a
#define S18C3                            BANKMASK(LCDDATA20), 2, a
#define S19C0                            BANKMASK(LCDDATA2), 3, a
#define S19C1                            BANKMASK(LCDDATA8), 3, a
#define S19C2                            BANKMASK(LCDDATA14), 3, a
#define S19C3                            BANKMASK(LCDDATA20), 3, a
#define S2                               BANKMASK(SSP2STAT), 3, b
#define S20C0                            BANKMASK(LCDDATA2), 4, a
#define S20C1                            BANKMASK(LCDDATA8), 4, a
#define S20C2                            BANKMASK(LCDDATA14), 4, a
#define S20C3                            BANKMASK(LCDDATA20), 4, a
#define S21C0                            BANKMASK(LCDDATA2), 5, a
#define S21C1                            BANKMASK(LCDDATA8), 5, a
#define S21C2                            BANKMASK(LCDDATA14), 5, a
#define S21C3                            BANKMASK(LCDDATA20), 5, a
#define S22C0                            BANKMASK(LCDDATA2), 6, a
#define S22C1                            BANKMASK(LCDDATA8), 6, a
#define S22C2                            BANKMASK(LCDDATA14), 6, a
#define S22C3                            BANKMASK(LCDDATA20), 6, a
#define S23C0                            BANKMASK(LCDDATA2), 7, a
#define S23C1                            BANKMASK(LCDDATA8), 7, a
#define S23C2                            BANKMASK(LCDDATA14), 7, a
#define S23C3                            BANKMASK(LCDDATA20), 7, a
